tap "adoptopenjdk/openjdk"
tap "esolitos/ipa"
tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "macoscontainers/formula"
tap "majd/repo"
tap "microsoft/git"
tap "ngrok/ngrok"
tap "railwaycat/emacsmacport"
tap "zkondor/dist"
brew "act"
brew "freetype"
brew "gettext"
brew "glib"
brew "xz"
brew "zstd"
brew "openjdk"
brew "antlr"
brew "ca-certificates"
brew "openssl@3"
brew "aria2"
brew "autoenv"
brew "automake"
brew "python@3.11"
brew "azure-cli"
brew "openjdk@11"
brew "bazel"
brew "binutils"
brew "bison"
brew "node"
brew "bitwarden-cli"
brew "brew-cask-completion"
brew "gcc"
brew "btop"
brew "caddy"
brew "chruby"
brew "circleci"
brew "libyaml"
brew "ruby"
brew "cocoapods"
brew "coreutils"
brew "cowsay"
brew "curl"
brew "devcontainer"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "dockutil"
brew "dotbot"
brew "dotnet"
brew "emacs"
brew "fastlane"
brew "fd"
brew "file-formula"
brew "fzf"
brew "gdbm"
brew "git"
brew "glow"
brew "libgpg-error"
brew "gnupg"
brew "go"
brew "gradle"
brew "httpie"
brew "jq"
brew "just"
brew "kotlin"
brew "kubernetes-cli"
brew "lazygit"
brew "libffi"
brew "llvm"
brew "lua"
brew "mackup"
brew "mas"
brew "mkcert"
brew "mono"
brew "mono-libgdiplus"
brew "neofetch"
brew "neovim"
brew "ninja"
brew "nu"
brew "nvm"
brew "ocaml"
brew "openssl@1.1"
brew "pinentry-mac"
brew "rename"
brew "ripgrep"
brew "ruby-install"
brew "rustup-init"
brew "shadowsocks-libev", restart_service: true
brew "tccutil"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "unzip"
brew "vale"
brew "vscode-langservers-extracted"
brew "wasmtime"
brew "watchman"
brew "wget"
brew "whalebrew"
brew "wimlib"
brew "xcodes", link: false
brew "yarn"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "railwaycat/emacsmacport/emacs-mac", link: false
cask "alacritty"
cask "anaconda"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "appcleaner"
cask "arc"
cask "balenaetcher"
cask "bitwarden"
cask "burp-suite"
cask "cheatsheet"
cask "chromedriver"
cask "chromium"
cask "cmake"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "displaylink"
cask "dotnet"
cask "fig"
cask "figma"
cask "firefox"
cask "flipper"
cask "flutter"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "fork"
cask "forklift"
cask "ghidra"
cask "gimp"
cask "github"
cask "gpg-suite-no-mail"
cask "graphql-playground"
cask "hammerspoon"
cask "hashicorp-vagrant"
cask "hyper"
cask "ipatool"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keepassxc"
cask "keycastr"
cask "kitty"
cask "lens"
cask "logi-options-plus"
cask "logitech-g-hub"
cask "maccy"
cask "macdown"
cask "meetingbar"
cask "messenger"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-office"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "monitorcontrol"
cask "mono-mdk-for-visual-studio"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "obs"
cask "obsidian"
cask "orbstack"
cask "orion"
cask "postman"
cask "powershell"
cask "protonvpn"
cask "qlcolorcode"
cask "r"
cask "rar"
cask "raycast"
cask "rectangle"
cask "redisinsight"
cask "sf-symbols"
cask "signal"
cask "skim"
cask "slack"
cask "sourcetree"
cask "stats"
cask "steam"
cask "sublime-text"
cask "tailscale"
cask "textual"
cask "the-unarchiver"
cask "thunderbird"
cask "tor-browser"
cask "tower"
cask "transmission"
cask "utm"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion"
cask "vscodium"
cask "warp"
cask "wechat"
cask "wezterm"
cask "whatsapp"
cask "whisky"
cask "xcodes"
cask "xquartz"
cask "zed"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "iA Writer", id: 775737590
mas "Pages", id: 409201541
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
